<template>
  <div class="article-wrapper">
    <div class="article">
      <h1>项目介绍</h1>
      <h2>简介</h2>
      <p>此项目是本人研究生阶段的毕业课题，基于浏览器制作一个简单的AI,用户只需通过简单的鼠标点击来预测一段时间后的光伏发电功率，从而为电网负载均衡提供帮助的一个项目。</p>
      <h2>想法诞生</h2>
      <p>最开始时，看到自己生物系同学为了用神经网络分析自己的实验数据不得不捧起一个python编程的书，去学习他完全不熟悉的编程时，
      想到我们可以在线编辑一个SVG，在线将CSV转为JSON数据，为什么不能做一个在线编辑神经网络的工具，帮助完全不会编程的学生完成他们的一些数据分析的需求。(虽然目前还未实现上传功能..)</p>
      <p>并且在研究生阶段也是有幸学习了一些web制作，人工智能算法相关的内容。于是便萌生了将电气，人工智能，web制作三大领域的知识融合在一起的想法。
        同时也被tensorflow.js能够在浏览器制作AI的功能深深吸引，于是做了一些小小的尝试，希望通过前端机器学习来解决一些真实场景下的电力预测问题。</p>
      <h3>项目意义</h3>
      <p><strong>对于被预测对象的意义</strong> 本次案例使用的是真实场景下的光伏电力数据，由于环保意识的加强，风力，太阳能等新自然能源逐渐被加大投入与开发。
      然而这样的能源由于天气环境等原因，极不稳定，非常容易对电网造成冲击，因此如果能提前预测发电功率，就可以提前做好防护。</p>
      <p>同时这样的线性预测,不单单适用于电网预测。比如你是一家餐厅的老板，如果你高估了第二天来店的顾客数量，意味着你买多的食材就面临被扔掉的风险，
        如果能有一个在线的帮助他们预测来店顾客数量的app，那么就能在一定程度上帮助他们规划开支。</p>
      <p><strong>对于机器学习的意义</strong> 在浏览器端完成机器学习，意味着我们不需要在服务器端跑庞大的人工智能模型，轻量级人工智能的训练在用户的浏览器完成。
        也是就是所谓的<strong>边缘计算</strong>。 这样的机器学习模型，具有着时间延迟小，就地解决，不泄露预测数据隐私等优点。</p>
      <p><strong>对于前端的意义</strong> 前端机器学习意味着，前端不仅仅只是页面与组件的制作。利用浏览器这个平台，未来前端也可以做出许多激动人心的应用。</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'A',
  mounted () {
    console.log(2222)
  }
}
</script>

<style lang="scss" scoped>
.article-wrapper {
  max-width: 1000px;
  word-wrap: break-word;
  word-break: break-all;
}
</style>
